In [1]:
import pandas as pd
import numpy as np

In [2]:
import matplotlib.pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.style.use('ggplot')

In [65]:
df = pd.read_csv('ppp_clean2.csv')

In [66]:
del df['Unnamed: 0']

In [67]:
df['NAICSCode'] = df['NAICSCode'].astype(str)

In [68]:
fil_ind = list(pd.Series(df['NAICSCode']).str.startswith('3'))

In [69]:
output = df.loc[fil_ind, :]

In [136]:
output['Loan Amt'].sum()

52713.8

In [25]:
fil_fourdigit = list(pd.Series(output['NAICSCode']).str.startswith('3111'))

In [26]:
output = output.loc[fil_fourdigit, :]
output = output.groupby(["NAICSCode"]).sum()

In [27]:
output

           Loan Amt
NAICSCode
311111.0     71.525
311119.0    175.625

### Get all 4 digit NAICS codes for Manufacturing
Returns 6 digit NAICS codes

In [52]:
lst1 = list(range(3112,3120)) + list(range(3251,3257)) + list(range(3259,3263)) + list(range(3271,3275)) + list(range(3311,3316)) + list(range(3321,3337)) + list(range(3341,3347)) + list(range(3351,3354)) + list(range(3361,3367))

In [56]:
# Convert lst1 to str 
lst1_str = [str(i) for i in lst1]

In [53]:
lst2 = ['3121', '3122', '3131', '3132', '3133', '3141', '3149', '3151', '3152', '3159', '3161', '3162', '3169', '3211',
'3212', '3219', '3221', '3222', '3231', '3241', '3279', '3339', '3359', '3369', '3371', '3372', '3379', '3391', '3399']

In [ ]:
master_manu_lst = lst1_str + lst2

In [61]:
master_manu_lst.sort()

### Group total loan amount by 6 digit NAICS code

In [124]:
def by_sector(naics):
    fil_fourdigit = list(pd.Series(output['NAICSCode']).str.startswith(naics))
    x = output.loc[fil_fourdigit, :]
    x = x.groupby(["NAICSCode"]).sum()
    return x

def sum_by4digit(naics):
    return by_sector(naics)['Loan Amt'].sum()

In [150]:
# tuple of 4 digit NAICS code and total loam amount in Million ($)

comb = []

for i in master_manu_lst:
    comb.append(tuple([i, sum_by4digit(str(i))]))

In [151]:
comb

[('3112', 159.85),
 ('3113', 287.4),
 ('3114', 445.27500000000003),
 ('3115', 403.25000000000006),
 ('3116', 562.7750000000002),
 ('3117', 135.225),
 ('3118', 867.2750000000003),
 ('3119', 1094.1000000000001),
 ('3121', 1031.025),
 ('3122', 35.0),
 ('3131', 49.22499999999998),
 ('3132', 213.1),
 ('3133', 175.80000000000004),
 ('3141', 161.125),
 ('3149', 361.17500000000007),
 ('3151', 47.55),
 ('3152', 469.275),
 ('3159', 270.5250000000001),
 ('3161', 37.89999999999999),
 ('3162', 58.64999999999999),
 ('3169', 60.29999999999999),
 ('3211', 317.0500000000001),
 ('3212', 271.975),
 ('3219', 1205.7250000000004),
 ('3221', 138.2),
 ('3222', 892.0250000000001),
 ('3231', 2239.1999999999994),
 ('3241', 515.6000000000001),
 ('3251', 448.87500000000006),
 ('3252', 396.20000000000016),
 ('3253', 188.77499999999998),
 ('3254', 758.6499999999999),
 ('3255', 362.525),
 ('3256', 483.37500000000006),
 ('3259', 454.35000000000014),
 ('3260', 0.0),
 ('3261', 2142.4749999999985),
 ('3262', 421.375),
 ('3271', 192.125),
 ('3272', 306.625),
 ('3273', 938.9),
 ('3274', 15.375),
 ('3279', 414.4000000000001),
 ('3311', 230.10000000000005),
 ('3312', 502.22500000000014),
 ('3313', 239.1),
 ('3314', 197.2),
 ('3315', 508.82499999999993),
 ('3321', 677.6250000000002),
 ('3322', 153.25),
 ('3323', 2905.074999999999),
 ('3324', 425.65000000000003),
 ('3325', 190.22500000000002),
 ('3326', 279.125),
 ('3327', 2236.299999999998),
 ('3328', 790.2500000000003),
 ('3329', 2052.8749999999986),
 ('3330', 0.0),
 ('3331', 1085.1000000000001),
 ('3332', 1108.6499999999996),
 ('3333', 513.0),
 ('3334', 587.325),
 ('3335', 1470.7750000000005),
 ('3336', 237.27499999999998),
 ('3339', 1767.3500000000004),
 ('3341', 324.2),
 ('3342', 471.87500000000006),
 ('3343', 174.025),
 ('3344', 1170.15),
 ('3345', 1286.275),
 ('3346', 125.42499999999998),
 ('3351', 366.80000000000007),
 ('3352', 69.87500000000001),
 ('3353', 515.9250000000001),
 ('3359', 650.4500000000002),
 ('3361', 267.175),
 ('3362', 502.7250000000001),
 ('3363', 1199.2),
 ('3364', 862.1000000000001),
 ('3365', 70.19999999999999),
 ('3366', 504.72500000000014),
 ('3369', 163.84999999999997),
 ('3371', 1155.675),
 ('3372', 624.6750000000001),
 ('3379', 155.05),
 ('3391', 1286.9499999999998),
 ('3399', 2332.4249999999984)]

In [152]:
df_4digit_manu = pd.DataFrame(comb, columns =['NAICS Code', 'Loan Amt'])

## Top 10 manufacturing sectors that received most PPP Loans
See https://www.uscourts.gov/sites/default/files/2012naics4-digitcodes_0.pdf for NAICS reference codes

In [156]:
df_4digit_manu.sort_values(by= 'Loan Amt', ascending=False).head(10)

   NAICS Code  Loan Amt
50       3323  2905.075
86       3399  2332.425
26       3231  2239.200
54       3327  2236.300
36       3261  2142.475
56       3329  2052.875
64       3339  1767.350
62       3335  1470.775
85       3391  1286.950
69       3345  1286.275